<?
$my_func = '2013';
//------------------------------------------------------------
//CY共通モジュール読み込み
//------------------------------------------------------------
require_once "../../include/lib/CYUtilsConst.inc.php";
require_once $LIB_PATH."/CYUtilsCommon.inc.php";
require_once $LIB_PATH."/CYUtilsStart.inc.php";
require_once $LIB_PATH."/CYUtilsCrypt.inc.php";
// require_once $LIB_PATH.'/ssktool'."/denbun_common.inc.php";

//------------------------------------------------------------
//ツール共通モジュール読み込み
//------------------------------------------------------------
require_once $CONF_PATH."/SaishunkanProperties.inc.php";
require_once $CONF_PATH."/SaishunkanUtils.inc.php";
require_once $CONF_PATH."/const.inc.php";

//------------------------------------------------------------
//セッションチェック
//------------------------------------------------------------
require_once $CONF_PATH."/SessionlogOff.inc.php";

//------------------------------------------------------------
//権限チェック
//------------------------------------------------------------
require_once $CONF_PATH."/SaishunkanAuthority.inc.php";

//------------------------------------------------------------
//初期値設定
//------------------------------------------------------------
$order_data = array();

//------------------------------------------------------------
//パラメータ取得
//------------------------------------------------------------
$recv_order_id = $_REQUEST['recv_order_id'];
//▼2012/03/13 R-#3125 贈り物Web対応 uls-motoi
$gift_flg = $_REQUEST['gift_flg'];

//------------------------------------------------------------
//DBから情報を取得
//------------------------------------------------------------

//------------------------------------------------------------
//ページ情報を取得
//------------------------------------------------------------
$pageInfo = getPageInfo();

//------------------------------------------------------------
//データファイルをインクルード
//------------------------------------------------------------
//▼2012/03/13 R-#3125 贈り物Web対応 uls-motoi
//ギフト注文の場合は、GIFT_TBLの情報を取得
if ($gift_flg == '0') {
    require_once ($DATA_PATH.'/'.$my_func.'/orderSheet.dat.php');
}elseif ($gift_flg == '1') {
    require_once ($DATA_PATH.'/'.$my_func.'/orderSheetGift.dat.php');
}

//------------------------------------------------------------
//ヘッダーをインクルード
//------------------------------------------------------------
//require_once ($LIB_PATH.'/CYUtilsHeader.inc.php');
//------------------------------------------------------------
//テンプレートをインクルード
//------------------------------------------------------------
if ($gift_flg == '0') {
    require_once ($TEMPLATE_PATH.'/'.$my_func.'/orderSheet.tpl.php');
}elseif ($gift_flg == '1') {
    require_once ($TEMPLATE_PATH.'/'.$my_func.'/orderSheetGift.tpl.php');
}
//------------------------------------------------------------
//フッターをインクルード
//------------------------------------------------------------
//require_once ($LIB_PATH.'/CYUtilsFooter.inc.php');
?>